iarsystems/ewarm-toshiba-example-projects/TMPM4GQ/Libraries/startup/startup_TMPM4GQ.s
                PUBWEAK INTTSSI0TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTSSI0TX_IRQHandler
                B       INTTSSI0TX_IRQHandler

                PUBWEAK INTTSSI0ERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTSSI0ERR_IRQHandler
                B       INTTSSI0ERR_IRQHandler

                PUBWEAK INTT32A14_A_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A14_A_IRQHandler
                B       INTT32A14_A_IRQHandler

                PUBWEAK INTT32A14_B_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A14_B_IRQHandler
                B       INTT32A14_B_IRQHandler

                PUBWEAK INTT32A14_CT_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A14_CT_IRQHandler
                B       INTT32A14_CT_IRQHandler

                PUBWEAK INTT32A15_A_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A15_A_IRQHandler
                B       INTT32A15_A_IRQHandler

                PUBWEAK INTT32A15_B_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A15_B_IRQHandler
                B       INTT32A15_B_IRQHandler

                PUBWEAK INTT32A15_C_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A15_C_IRQHandler
                B       INTT32A15_C_IRQHandler

                PUBWEAK INTMDMAADISR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMDMAADISR_IRQHandler
                B       INTMDMAADISR_IRQHandler

                END
